elisp/dot-emacs.org
#+PROPERTY: header-args :tangle .emacs

* commentary
** loading order
 1. bind key
 2. my map
 3. detect env
 4. (load-env) -- random shit
 5. use-package hydra
 6. set org-user-agenda-files
 7. load org
    - requires org
    - sets agenda-files from org-user-agenda-files
 8. (load-from-env "org")
    - sets org tags, capture templates, etc
    - defines org hydra refiling funcs
** the only thing in .emacs.d is melpa packages and some state files
* Immediately set org-mode path
#+BEGIN_SRC emacs-lisp
;;;
;;; Org Mode
;;;
(add-to-list 'load-path (expand-file-name "~/extern/org-mode/lisp"))
(add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\|txt\\)$" . org-mode))

;; broken notifications -- workaround [2020-02-14 Fri]
(setq org-show-notification-handler (lambda (msg) (message "%s" msg)))

(require 'org)
#+END_SRC
* Package Management

#+BEGIN_SRC emacs-lisp

(setq
 package-enable-at-startup nil
 package-archives
 '(("melpa-stable" . "https://stable.melpa.org/packages/")
   ("melpa" . "https://melpa.org/packages/")
   ("org" . "http://orgmode.org/elpa/")
   ("gnu" . "https://elpa.gnu.org/packages/")))

(setq package-archive-priorities '(("melpa-stable" . 100)))

(require 'package)
(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t
      use-package-verbose t)

;(setq debug-on-quit t)
#+END_SRC
* ~src/home/elisp directory

#+BEGIN_SRC emacs-lisp
(defvar l-src-home (file-truename "~/src/home/"))
(defvar l-elisp-home (file-truename "~/src/home/elisp/"))
(add-to-list 'load-path (concat l-elisp-home "lib"))
#+END_SRC

#+results:
: l-elisp-home


* refiling

#+BEGIN_SRC emacs-lisp

;; Adapted from https://emacs.stackexchange.com/questions/8045/org-refile-to-a-known-fixed-location
(defun my/refile (file headline &optional arg)
  "Refile to a specific location. 

With a 'C-u' ARG argument, we jump to that location (see
`org-refile').

Use `org-agenda-refile' in `org-agenda' mode."
  (let* ((pos (with-current-buffer (or (get-buffer file)	;Is the file open in a buffer already?
				       (find-file-noselect file)) ;Otherwise, try to find the file by name (Note, default-directory matters here if it isn't absolute)
		(or (org-find-exact-headline-in-buffer headline)
		    (error "Can't find headline `%s'" headline))))
	 (filepath (buffer-file-name (marker-buffer pos)));If we're given a relative name, find absolute path
	 (rfloc (list headline filepath nil pos)))
    (if (and (eq major-mode 'org-agenda-mode) (not (and arg (listp arg)))) ;Don't use org-agenda-refile if we're just jumping
	(org-agenda-refile nil rfloc)
      (org-refile arg nil rfloc))))

(defun josh/refile (file headline &optional arg)
  "Refile to HEADLINE in FILE. Clean up org-capture if it's activated.

With a `C-u` ARG, just jump to the headline."
  (interactive "P")
  (let ((is-capturing (and (boundp 'org-capture-mode) org-capture-mode)))
    (cond
     ((and arg (listp arg))	    ;Are we jumping?
      (my/refile file headline arg))
     ;; Are we in org-capture-mode?
     (is-capturing      	;Minor mode variable that's defined when capturing
      (josh/org-capture-refile-but-with-args file headline arg)) 
     (t
      (my/refile file headline arg)))
    (when (or arg is-capturing)
      (setq hydra-deactivate t))))

(defun josh/org-capture-refile-but-with-args (file headline &optional arg)
  "Copied from `org-capture-refile' since it doesn't allow passing arguments. This does."
  (unless (eq (org-capture-get :type 'local) 'entry)
    (error
     "Refiling from a capture buffer makes only sense for `entry'-type templates"))
  (let ((pos (point))
	(base (buffer-base-buffer (current-buffer)))
	(org-capture-is-refiling t)
	(kill-buffer (org-capture-get :kill-buffer 'local)))
    (org-capture-put :kill-buffer nil)
    (org-capture-finalize)
    (save-window-excursion
      (with-current-buffer (or base (current-buffer))
	(org-with-wide-buffer
	 (goto-char pos)
	 (my/refile file headline arg))))
    (when kill-buffer (kill-buffer base))))

#+END_SRC

#+begin_src emacs-lisp

;; refile in reverse-chron
(setq org-reverse-note-order t)

#+end_src

* Elisp programming
#+begin_src emacs-lisp
(use-package dash)
#+end_src
* Keybindings

#+begin_src emacs-lisp
(use-package free-keys :defer t)
(use-package bind-key  :defer t)
(define-prefix-command 'my-map)
(bind-key "C-1" 'my-map)
(use-package which-key)
#+end_src
* work or home environment
** detect
#+BEGIN_SRC emacs-lisp

(defvar l-env-file (concat l-elisp-home "environment.el"))

(defun read-file (filePath)
  "Return filePath's file content as lisp object"
  (with-temp-buffer
    (insert-file-contents filePath)
    (read (buffer-string))))

(setq l-env (read-file l-env-file))

(defun load-env ()
  (load-file (concat l-elisp-home l-env ".el")))

(defun load-from-env (code-name)
  (load-file (concat l-elisp-home code-name "-" l-env ".el")))

#+END_SRC

#+results:
: work
** load
#+BEGIN_SRC emacs-lisp
(load-env)
#+END_SRC

* Ivy / Counsel

#+BEGIN_SRC emacs-lisp

(defun l-c-o () (interactive)
 (global-set-key (kbd "C-x C-f") 'counsel-find-file)
 (setq read-file-name-function 'read-file-name-default))

(use-package swiper)
(use-package counsel
  :bind (("C-b" . ivy-switch-buffer)
         ("C-s" . swiper)
         :map my-map
         ("q" . counsel-rg))
  :config (ivy-mode 1)
  :init
  (progn
    (ido-mode -1) ;; Turn off ido mode in case I enabled it accidentally
    (setq ivy-wrap t)
    (setq ivy-use-virtual-buffers t
          ivy-height 20)
    (setq enable-recursive-minibuffers t)
    (setq counsel-rg-base-command
          "rg -M 180 --no-heading --line-number --color never %s .")
    (global-set-key (kbd "C-c C-r") 'ivy-resume)
    (global-set-key (kbd "<f6>") 'ivy-resume)
    (global-set-key (kbd "M-x") 'counsel-M-x)
    (global-set-key (kbd "C-x C-f") 'counsel-find-file)
    (global-set-key (kbd "<f1> f") 'counsel-describe-function)
    (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
    (global-set-key (kbd "<f1> l") 'counsel-find-library)
    (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
    (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
    (global-set-key (kbd "C-r") 'counsel-git)
    (global-set-key (kbd "C-c j") 'counsel-git-grep)
    (global-set-key (kbd "C-c k") 'counsel-ag)
                                        ;    (global-set-key (kbd "C-x l") 'counsel-locate)
    (define-key read-expression-map (kbd "C-r") 'counsel-expression-history)))
#+END_SRC

#+results:

* hydra

#+BEGIN_SRC emacs-lisp
(use-package hydra)
#+END_SRC


* Org
[2017-06-05 Mon 09:42]
** load agenda-files
Set this before loading Bernt.
#+begin_src emacs-lisp
(load-from-env "org-user-agenda-files")
#+end_src
** load Bernt

I start from [[file:org-mode.org::#HowToUseThisDocument][Bernt's org-mode.org]]
#+BEGIN_SRC emacs-lisp
(load (concat l-elisp-home "org-mode.el"))
#+END_SRC
** load org environment

#+begin_src emacs-lisp

(load-from-env "org")

#+end_src
** jump to directory associated with an entry
#+BEGIN_SRC emacs-lisp
(defun l-org-jump-to-dir ()
  (interactive)
  (if (eq major-mode 'org-mode)
      (if-let ((headers (org-entry-get (point) "header-args" t)))
          (let* ((props (org-babel-parse-header-arguments headers))
                (dir (cdr (assoc :dir props))))
            (if dir (progn
                      (find-file dir)
                      (magit-status)
                      (delete-other-windows))
              (magit-status)))
        (magit-status))
    (magit-status)))

#+END_SRC
** agenda stuff

#+BEGIN_SRC emacs-lisp
(fset 'l-org-goto-clean-agenda
      "\C-\\ g.ro")

(bind-key "w" 'l-org-goto-clean-agenda my-map)

#+END_SRC

*** source code 
#+BEGIN_SRC emacs-lisp
(eval-after-load 'org-src
  '(define-key org-src-mode-map
     "\C-x\C-s" #'org-edit-src-exit))

#+END_SRC

** beginning of block FIXME
#+BEGIN_SRC emacs-lisp

(defun l-beginning-of-block ()
  (interactive)
  (org-babel-mark-block)
  (exchange-point-and-mark))

  (setq org-M-RET-may-split-line '((default . nil)))

(fset 'l-org-new-line-at-end
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([3 14 left return] 0 "%d")) arg)))

(bind-key "e" 'l-org-new-line-at-end my-map)
#+END_SRC
** super-agenda
#+BEGIN_SRC emacs-lisp

(use-package org-super-agenda
  :config
  (progn
    (org-super-agenda-mode)
    (setq org-super-agenda-groups
          '((:todo "WAITING" :order 500)
            (:name "STATUS" :order 100 :and (:habit t :regexp "status"))
            (:name "HABITS" :order 200 :habit t)
            (:order 300 :anything t)))))
#+END_SRC
** other miscellaneous settings

#+begin_src emacs-lisp
(setq org-startup-folded 'content)
#+end_src
** Babel
*** tangle .emacs on save

#+begin_src emacs-lisp

(defvar l-dot-emacs (concat l-elisp-home "dot-emacs.org"))

(defun my/tangle-on-save-emacs-config-org-file ()
  (when (string= buffer-file-name l-dot-emacs)
    (org-babel-tangle)))

(add-hook 'after-save-hook 'my/tangle-on-save-emacs-config-org-file)

#+end_src
*** languages
** Habits
#+begin_src emacs-lisp

(setq org-habit-preceding-days 27
      org-habit-following-days 1)

#+end_src
** exporting

#+begin_src emacs-lisp

(require 'ox-md)

#+end_src
*** 
#+begin_src emacs-lisp
;; This is an Emacs package that creates graphviz directed graphs from
;; the headings of an org file
(use-package org-mind-map
  :init
  (require 'ox-org)
  :ensure t
  ;; Uncomment the below if 'ensure-system-packages` is installed
  ;;:ensure-system-package (gvgen . graphviz)
  :config
  (setq org-mind-map-engine "dot")       ; Default. Directed Graph
  ;; (setq org-mind-map-engine "neato")  ; Undirected Spring Graph
  ;; (setq org-mind-map-engine "twopi")  ; Radial Layout
  ;; (setq org-mind-map-engine "fdp")    ; Undirected Spring Force-Directed
  ;; (setq org-mind-map-engine "sfdp")   ; Multiscale version of fdp for the layout of large graphs
  ;; (setq org-mind-map-engine "twopi")  ; Radial layouts
  ;; (setq org-mind-map-engine "circo")  ; Circular Layout
  )
#+end_src
** Publishing
#+begin_src emacs-lisp

(setq org-publish-project-alist '(("darwin-docs" :base-directory "~/doc/org/2/non-agenda/project-darwin"
                                   :publishing-directory "~/doc/published-projects/darwin"
                                   :base-extension "org"
                                   :recursive t
                                   :html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"/project-styles.css\" />"
                                   :html-head-include-default-style nil
                                   :html-head-extra ""
                                   :publishing-function org-html-publish-to-html
                                   :auto-sitemap t
                                   :makeindex t)
                                  ("darwin-imgs" :base-directory "~/doc/org/2/non-agenda/project-darwin"
                                   :publishing-directory "~/doc/published-projects/darwin"
                                   :base-extension "png\\|jpg\\|jpeg"
                                   :recursive t
                                   :publishing-function org-publish-attachment)
                                  ("darwin" :components ("darwin-docs" "darwin-imgs"))
                                  ("stinkless" :base-directory "~/doc/org/2/non-agenda"
                                   :publishing-directory "~/doc/published-projects/stinkless"
                                   :recursive t
                                   :publishing-function org-html-publish-to-html
                                   :auto-sitemap t
                                   :makeindex t)))

#+end_src
** Custom Links
*** ripgrep/counsel
#+begin_src emacs-lisp

(defconst org+-counselrg-link-type "counselrg"
  "String for identifying counsel-rg links.")

(defun org+-buffer-base-name (buffer-name)
  "Remove trailing <.*> in BUFFER-NAME."
  (save-match-data
    (when (string-match "<[^<>]+>\\'" buffer-name)
      (setq buffer-name (substring buffer-name nil (match-beginning 0)))))
  buffer-name)

(defun org+-counselrg-store ()
  "Store links of type counselrg:LINK-PATH."
  (when (derived-mode-p 'ivy-occur-grep-mode)
    (org-store-link-props :type org+-counselrg-link-type
              :link (format "%s:%S" org+-counselrg-link-type (cons default-directory (org+-buffer-base-name (buffer-name))))
              :description (format "%s in %s" (buffer-name) default-directory))
    t))

(defun org+-counselrg-follow (link-path)
  "Follow org-links of type counselrg:LINK-PATH."
  (let* ((caller-window (get-buffer-window))
     (dir-buf (read link-path))
     (dir-name (car dir-buf))
     (buf-name (cdr dir-buf))
     (buf
      ;; First try to re-use already existing buffer.
      (cl-loop for buf in (buffer-list)
           if (with-current-buffer buf
            (and
             (derived-mode-p 'ivy-occur-grep-mode)
             (file-equal-p default-directory dir-name)
             (string-equal
              (org+-buffer-base-name (buffer-name))
              buf-name
              )))
           do (with-current-buffer buf (ivy-occur-revert-buffer))
           and return buf
           finally
           ;; if there is no buffer for re-use:
           return
           (with-current-buffer (generate-new-buffer buf-name)
             (setq default-directory dir-name)
             (ivy-occur-grep-mode)
             (let ((inhibit-read-only t)
               (counsel-ag-base-command counsel-rg-base-command))
               (setq-local ivy-occur-last
                   (make-ivy-state
                    :directory default-directory
                    :caller 'counsel-ag
                    :window caller-window
                    :buffer (current-buffer)
                    ))
               (counsel-rg-occur))
             (current-buffer))
           )))
    (switch-to-buffer buf)))

(org-link-set-parameters org+-counselrg-link-type
             :follow #'org+-counselrg-follow
             :store #'org+-counselrg-store)

#+end_src
** Keybindings

#+begin_src emacs-lisp

(bind-key "C-." 'l-org-jump-to-dir org-mode-map)
(bind-key "M-h" 'ace-jump-mode org-mode-map)
(bind-key "M-z" 'ace-jump-char-mode org-mode-map)



#+end_src
** utility functions

*** om library
I deleted the .git directory and pulled in the source code.

#+begin_src emacs-lisp

(add-to-list 'load-path (concat l-elisp-home "lib/om.el"))
(require 'om)

#+end_src
*** estimating and planning

**** committed efforts

#+begin_src emacs-lisp

(fset 'l-update-efforts-subtree
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ("q" 0 "%d")) arg)))

(defun lsc ()
  (interactive)
  (l-update-efforts-subtree)
  (org-entry-put (point) "COMMITTED_EFFORT" (org-entry-get (point) "EFFORT")))


#+end_src
