elisp/dot-emacs.org
*** general
#+BEGIN_SRC emacs-lisp

(setq org-tag-alist '(
                      ("FLAGGED" . ??)
                      ("MATT" . ?m)
                      ("NOTE" . ?n)
                      ("RETRO" . ?r)
                      (:startgrouptag)
                      ("GOALS")
                      (:grouptags)
                      ("STRETCH")
                      ("CORPORATE")
                      ("PERSONAL")
                      (:endgrouptag)
                      (:startgrouptag)
                      ("STRETCH")
                      (:grouptags)
                      ("INTELLECTION" . ?i)
                      ("CONTEXT" . ?c)
                      ("STRATEGIC" . ?s)
                      ("LEARNER" . ?l)
                      ("INPUT" . ?p)
                      (:endgrouptag)
                      (:startgrouptag)
                      ("PERSONAL")
                      (:grouptags)
                      ("EDUCATION")
                      ("TESTING")
                      ("ENGINEERING")
                      ("COLLABORATION")
                      ("MONITORING")
                      (:endgrouptag)
                      (:startgrouptag)
                      ("CORPORATE")
                      (:grouptags)
                      ("WORKING_OUTSIDE_IN")
                      ("DRIVING_WITH_DATA")
                      ("EXECUTING_WITH_AGILITY")
                      ("PARTNERING_ACROSS_TEAMS")
                      (:endgrouptag)))


(setq org-directory (expand-file-name "~/Workspace/docs/org"))
(setq org-default-notes-file "~/Workspace/docs/org/refile.org")
#+END_SRC
*** capture
#+BEGIN_SRC emacs-lisp
;; Capture templates
;; U - inactive timestamp
;; a - link
(setq org-capture-templates
      (quote (("t" "todo" entry (file "~/Workspace/docs/org/refile.org")
               "* NEXT [#B] %?\n%U\n%a\n" :clock-in t :clock-resume t)
              ("r" "review" entry (file "~/Workspace/docs/org/refile.org")
               "* NEXT [#A] Review: %? :REVIEW: \nSCHEDULED: %t\n%U\n%a\n" :clock-in t :clock-resume t)
              ("b" "bio" entry (file+olp "~/Workspace/docs/org/work.org" "Bio")
               "* MEETING Bio \n%U\n" :clock-in t :clock-keep t :immediate-finish t)
              ("e" "email" entry (file+olp "~/Workspace/docs/org/work.org" "Misc-Work" "Email")
               "* MEETING Email\n%U\n" :clock-in t :clock-keep t :immediate-finish t)
              ("f" "reflection" entry (file "~/Workspace/docs/org/refile.org")
               "* MEETING Reflection: %?\n%U\n" :clock-in t :clock-keep t)
              ("s" "self" entry (file+olp "~/Workspace/docs/org/work.org" "Self")
               "* MEETING Self \n%U\n" :clock-in t :clock-keep t :immediate-finish t)
              ("u" "avalon ui" entry (file+olp "~/Workspace/docs/org/work.org" "Avalon" "avui")
               "* NEXT  %? [%]\nSCHEDULED: %t\n%U\n%a\n** \n** commit message\n** consider testing\n" :clock-in t :clock-resume t)
              ("h" "achieve" entry (file+olp "~/Workspace/docs/org/work.org" "Avalon" "avach")
               "* NEXT ACHIEVE: %? [%]\nSCHEDULED: %t\n%U\n%a\n** NEXT \n** NEXT \n** NEXT consider testing\n" :clock-in t :clock-resume t)
              ("n" "note" entry (file "~/Workspace/docs/org/refile.org")
               "* %? :NOTE:\n%U\n%a\n" :clock-in t :clock-resume t)
              ("m" "Meeting" entry (file "~/Workspace/docs/org/refile.org")
               "* MEETING with %? :MEETING:\n%U" :clock-in t :clock-keep t)
              ("v" "Event" entry (file+olp "~/Workspace/docs/org/work.org" "Events")
               "*  %? :EVENT:\n%U\n")
              ("x" "Habit" entry (file "~/Workspace/docs/org/refile.org")
               "* NEXT %?\n%U\n%a\nSCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d/3d>>\")\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n"))))

#+END_SRC
*** refiling

#+begin_src emacs-lisp

(defmacro josh/make-org-refile-hydra (hydraname file keyandheadline)
  "Make a hydra named HYDRANAME with refile targets to FILE.
KEYANDHEADLINE should be a list of cons cells of the form (\"key\" . \"headline\")"
  `(defhydra ,hydraname (:color blue :after-exit (unless (or hydra-deactivate
							     current-prefix-arg) ;If we're just jumping to a location, quit the hydra
						   (josh/org-refile-hydra/body)))
     ,file
     ,@(cl-loop for kv in keyandheadline
		collect (list (car kv) (list 'josh/refile file (cdr kv) 'current-prefix-arg) (cdr kv)))
     ("q" nil "cancel")))

(josh/make-org-refile-hydra josh/org-refile-hydra-file-a
                            "~/Workspace/docs/org/work.org"
			    (("a" . "Myteam")
			     ("u" . "avui")
                             ("g" . "Glossary")
                             ("h" . "avach")
			     ("c" . "Career")
                             ("m" . "Meetings")
                             ("i" . "Misc-Work")
                             ("e" . "Events")
                             ("s" . "Sketchpad")
                             ("w" . "Work")
                             ("y" . "Sasysaw-MHE")))

(josh/make-org-refile-hydra josh/org-refile-hydra-file-widgets
                            "~/Workspace/docs/org/work.org"
			    (("y" . "Table-Type-Entry")
                             ("i" . "Widgets")
                             ("c" . "Choose-Your-Path")
                             ))

(josh/make-org-refile-hydra josh/org-refile-hydra-file-b
                            "~/Workspace/docs/org/diary.org"
			    (("e" . "MyEvents")))

(defhydra josh/org-refile-hydra (:foreign-keys run) 
  "Refile"
  ("w" josh/org-refile-hydra-file-a/body "Work" :exit t)
  ("i" josh/org-refile-hydra-file-widgets/body "Widgets" :exit t)
  ("j" org-refile-goto-last-stored "Jump to last refile" :exit t)
  ("q" nil "cancel"))

(bind-key "r" 'josh/org-refile-hydra/body 'my-map)

#+end_src
*** common work chores
**** delete old branches

#+begin_src emacs-lisp

(defun l-work-goto-next-project-to-clean ()
  (interactive)
  (let* ((headline (om-parse-this-headline))
         ;; (match (om-match '(headline section plain-list) headline))
         (match (om-match '(headline section) headline)))
    match))

(defun l-work-goto-next-project-to-clean-headline ()
  (interactive)
  (let* ((headline (om-parse-this-headline)))
    headline))

;; todo: keep querying. toplevel structure is (headline (section . . (plain-list ))
#+end_src
**** insert new link to note based on jira task
#+begin_src emacs-lisp

(eval-when-compile (require 'cl-lib))

(defun l-om-link-text (link)
  (cl-assert (listp link))
  (car (om-get-children link)))

(defun l-get-jira-title ()
  (-as-> (om-parse-this-headline) $
                       (om-get-property :title $)
                       (list (l-om-link-text (car $))
                             (cadr $))))

(defun l-insert-jira-title ()
  (interactive)
  (pcase-let ((`(,jira-item ,title) (l-get-jira-title)))
    (insert (concat jira-item " " title "\nnotes"))))

#+end_src
** other
#+BEGIN_SRC emacs-lisp
(defun l-getenv (var)
  (shell-command-to-string (concat ". ~/.bashrc; echo -n $" var)))

(setq mouse-wheel-scroll-amount '(3 ((shift) . 3))) ;; lines at a time
    
(setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling

(set-register ?v '(file . "/Users/lyn_headley/Workspace/acme/DLE-Acme-Vivarium/public/svn/sn_0dce"))
(set-register ?g '(file . "/Users/lyn_headley/Workspace/glossary/g"))
(set-register ?a '(file . "/Users/lyn_headley/Workspace/asset-registry/a"))
(set-register ?f '(file . "/Users/lyn_headley/Workspace/docs/org/non-agenda/frontend.org"))
(set-register ?b '(file . "/Users/lyn_headley/Workspace/bb-scripts"))

(defun l-show-make-var ()
  (interactive)
    (cl-flet ((my-word-at-point ()
                             (buffer-substring
                              (+ 1 (save-excursion (search-backward "(" nil t)))
                              (- (save-excursion (search-forward ")" nil t)) 1))))

  (let ((cmd-str  (concat "make print-"
                          (my-word-at-point))))
                                   ;(buffer-substring (region-beginning) (region-end)))))
    (let ((default-directory "/Users/lyn_headley/Workspace/WebGSP/"))
      (message "%s" (shell-command-to-string cmd-str))))))

#+END_SRC
** Shells and terminals

#+BEGIN_SRC emacs-lisp
(use-package exec-path-from-shell
  :config (exec-path-from-shell-initialize))
#+END_SRC
** terraform

(use-package terraform-mode)
** learning the org chart

*** template
#+begin_src emacs-lisp
(defconst l-drill-org-template
  "** Lyn Headley
,***                                                                 :drill:
Lyn Headley Boss
,**** 
jj-Boss
,***                                                                 :drill:
Lyn Headley joined
,**** 
jj-Joined
,***                                                                 :drill:
Lyn Headley title
,**** 
jj-Title
")
#+end_src
